In [3]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('02_03_import_export.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   기준년월             240 non-null    int64
 1   국가코드             239 non-null    object
 2   수출입구분코드          240 non-null    object
 3   순위               240 non-null    int64
 4   국가명              240 non-null    object
 5   수출입구분명           240 non-null    object
 6   당월수출입중량(KG)      240 non-null    int64
 7   당월수출입미화금액(1$)    240 non-null    int64
 8   당해누계수출입중량(KG)    240 non-null    int64
 9   당해누계수출입미화금액(1$)  240 non-null    int64
 10  데이터기준일자          240 non-null    object
dtypes: int64(6), object(5)
memory usage: 20.8+ KB

In [ ]:
df['기준년월'].drop_duplicates(inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   기준년월             240 non-null    int64
 1   국가코드             239 non-null    object
 2   수출입구분코드          240 non-null    object
 3   순위               240 non-null    int64
 4   국가명              240 non-null    object
 5   수출입구분명           240 non-null    object
 6   당월수출입중량(KG)      240 non-null    int64
 7   당월수출입미화금액(1$)    240 non-null    int64
 8   당해누계수출입중량(KG)    240 non-null    int64
 9   당해누계수출입미화금액(1$)  240 non-null    int64
 10  데이터기준일자          240 non-null    object
dtypes: int64(6), object(5)
memory usage: 18.9+ KB

In [ ]:
df.drop(['기준년월'], axis=1)

    국가코드 수출입구분코드   순위  ... 당해누계수출입중량(KG) 당해누계수출입미화금액(1$)     데이터기준일자
0     JP       E    1  ...      55539745       299424316  2018-06-30
1     CN       E    2  ...      36693396       146829048  2018-06-30
2     US       E    3  ...      11334472       122340001  2018-06-30
3     TH       E    4  ...      45091849       109772167  2018-06-30
4     VN       E    5  ...      27220329        50271653  2018-06-30
..   ...     ...  ...  ...           ...             ...         ...
235   LA       I  114  ...           130             176  2018-06-30
236   MN       I  115  ...            21             141  2018-06-30
237   FI       I  116  ...             6             120  2018-06-30
238   GT       I  117  ...             2              93  2018-06-30
239   JO       I  118  ...             2              54  2018-06-30

[240 rows x 10 columns]

Noheader

In [ ]:
df = pd.read_csv('member.txt', header=None)
df

         0            1       2    3
0     name        class  gender  age
1     John  Mathematics    male   18
2     Liam   E-Business  female   19
3     Noah  Mathematics  female   20
4    Logan     Computer    male   20
5    Lucas   E-Business    male   21
6    Mason   E-Business    male   21
7   Oliver   E-Business  female   21
8    Ethan     Computer    male   22
9   Elijah     Computer  female   22
10   Aiden   Accounting  female   22
11   James     Computer    male   22
12  Sophia      Finance    male   23
13    Emma   Accounting    male   23
14   Emily      Finance    male   23
15   Grace     Computer    male   23
16  Hailey      Finance    male   23

In [ ]:
df.to_csv('save.csv')

In [ ]:
# 깨진데이터 읽어오기

In [ ]:
df = pd.read_csv('03_05_data.csv', header=None, encoding='euc-kr')
df

   0  1    2    3   4      5
0  1  김  100  100  15   True
1  2  이   90   80  16   True
2  3  나   80   70  15  False
3  4  박   70   60  14  False

In [ ]:
df = pd.read_csv('03_05_data.csv', header=None, encoding='euc-kr', delimiter='/')
df

In [ ]:
df.columns=['번호', '이름', '국어', '영어', '나이', '합격여부']